# Terraform `environment` `test`
#### Initialization ⚙️`success`
#### Format and Style 🖌`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Truncated to 120000 bytes! See logoutput for complete plan]
Acquiring state lock. This may take a few moments...
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1jMjE3YTNlYS00MDJmLTQ4ODYtYWNlNS00NzhkYjcyYWI0Yzk7b2JqZWN0SWQ9Y2M3NWExY2MtZDZhMS00NTMwLTgyOGYtODY4MzJjZTkxYjliO3N1YnNjcmlwdGlvbklkPWNjNmI1ODg2LTM2YWYtNGQ1NC05ZDMwLTFiMGZmZmM3MzZkODt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
module.observability.data.azurerm_client_config.current: Reading...
module.observability.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1jMjE3YTNlYS00MDJmLTQ4ODYtYWNlNS00NzhkYjcyYWI0Yzk7b2JqZWN0SWQ9Y2M3NWExY2MtZDZhMS00NTMwLTgyOGYtODY4MzJjZTkxYjliO3N1YnNjcmlwdGlvbklkPWNjNmI1ODg2LTM2YWYtNGQ1NC05ZDMwLTFiMGZmZmM3MzZkODt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.azure_service_operator.azapi_resource.aso will be created
  + resource "azapi_resource" "aso" {
      + body                      = {
          + properties = {
              + kustomizations             = {
                  + aso = {
                      + force                  = false
                      + path                   = "./"
                      + postBuild              = {
                          + substitute = {
                              + AZURE_CLIENT_ID       = "1002fa80-0655-4440-9a89-b99330ee2d9c"
                              + AZURE_SUBSCRIPTION_ID = "cc6b5886-36af-4d54-9d30-1b0fffc736d8"
                              + AZURE_TENANT_ID       = "cd0026d8-283b-4a55-9bfa-d0ef4a8ba21c"
                              + CRD_PATTERN           = "managedidentity.azure.com/*;authorization.azure.com/*"
                            }
                        }
                      + prune                  = false
                      + retryIntervalInSeconds = 300
                      + syncIntervalInSeconds  = 300
                      + timeoutInSeconds       = 300
                      + wait                   = true
                    }
                }
              + namespace                  = "flux-system"
              + ociRepository              = {
                  + insecure              = false
                  + repositoryRef         = {
                      + tag = "at_ring2"
                    }
                  + syncIntervalInSeconds = 300
                  + timeoutInSeconds      = 300
                  + url                   = "oci://altinncr.azurecr.io/manifests/infra/azure-service-operator"
                  + useWorkloadIdentity   = true
                }
              + reconciliationWaitDuration = "PT5M"
              + sourceKind                 = "OCIRepository"
              + waitForReconciliation      = true
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + ignore_null_property      = false
      + name                      = "azure-service-operator"
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/cc6b5886-36af-4d54-9d30-1b0fffc736d8/resourceGroups/corr-at22-aks-rg/providers/Microsoft.ContainerService/managedClusters/corr-at22-aks"
      + schema_validation_enabled = true
      + sensitive_body            = (write-only attribute)
      + type                      = "Microsoft.KubernetesConfiguration/fluxConfigurations@2024-11-01"
    }

  # module.grafana.azurerm_dashboard_grafana.grafana will be created
  + resource "azurerm_dashboard_grafana" "grafana" {
      + api_key_enabled                        = true
      + auto_generated_domain_name_label_scope = "TenantReuse"
      + deterministic_outbound_ip_enabled      = true
      + endpoint                               = (known after apply)
      + grafana_major_version                  = "11"
      + grafana_version                        = (known after apply)
      + id                                     = (known after apply)
      + location                               = "norwayeast"
      + name                                   = "grafana-corr-at22"
      + outbound_ip                            = (known after apply)
      + public_network_access_enabled          = true
      + resource_group_name                    = "grafana-corr-at22-rg"
      + sku                                    = "Standard"
      + zone_redundancy_enabled                = false

      + azure_monitor_workspace_integrations {
          + resource_id = "/subscriptions/cc6b5886-36af-4d54-9d30-1b0fffc736d8/resourceGroups/corr-at22-obs-rg/providers/Microsoft.Monitor/accounts/corr-at22-obs-amw"
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # module.grafana.azurerm_resource_group.grafana will be created
  + resource "azurerm_resource_group" "grafana" {
      + id       = (known after apply)
      + location = "norwayeast"
      + name     = "grafana-corr-at22-rg"
    }

  # module.grafana.azurerm_role_assignment.amw_datareaderrole["default-obs-workspace"] will be created
  + resource "azurerm_role_assignment" "amw_datareaderrole" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = "/subscriptions/cc6b5886-36af-4d54-9d30-1b0fffc736d8/providers/Microsoft.Authorization/roleDefinitions/b0d8363b-8ddd-447d-831f-62ca05bff136"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/cc6b5886-36af-4d54-9d30-1b0fffc736d8/resourceGroups/corr-at22-obs-rg/providers/Microsoft.Monitor/accounts/corr-at22-obs-amw"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.grafana.azurerm_role_assignment.grafana_admin["143ed28a-6e6d-4ca0-8273-eecb9c1665ba"] will be created
  + resource "azurerm_role_assignment" "grafana_admin" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "143ed28a-6e6d-4ca0-8273-eecb9c1665ba"
      + principal_type                   = "Group"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Grafana Admin"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = true
    }

  # module.grafana.azurerm_role_assignment.grafana_admin_sp will be created
  + resource "azurerm_role_assignment" "grafana_admin_sp" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "cc75a1cc-d6a1-4530-828f-86832ce91b9b"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Grafana Admin"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = true
    }

  # module.grafana.azurerm_role_assignment.grafana_editor["416302ed-fbab-41a4-8c8d-61f486fa79ca"] will be created
  + resource "azurerm_role_assignment" "grafana_editor" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "416302ed-fbab-41a4-8c8d-61f486fa79ca"
      + principal_type                   = "Group"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Grafana Editor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = true
    }

  # module.grafana.azurerm_role_assignment.grafana_permission["cc6b5886-36af-4d54-9d30-1b0fffc736d8"] will be created
  + resource "azurerm_role_assignment" "grafana_permission" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = "/subscriptions/cc6b5886-36af-4d54-9d30-1b0fffc736d8"
      + skip_service_principal_aad_check = true
    }

  # module.grafana.grafana_service_account.admin will be created
  + resource "grafana_service_account" "admin" {
      + id          = (known after apply)
      + is_disabled = false
      + name        = "admin-service-account"
      + role        = "Admin"
    }

  # module.grafana.grafana_service_account_token.grafana_operator will be created
  + resource "grafana_service_account_token" "grafana_operator" {
      + expiration         = (known after apply)
      + has_expired        = (known after apply)
      + id                 = (known after apply)
      + key                = (sensitive value)
      + name               = "grafana-operator"
      + service_account_id = (known after apply)
    }

  # module.infra-resources.azapi_resource.cert_manager will be created
  + resource "azapi_resource" "cert_manager" {
      + body                      = {
          + properties = {
              + kustomizations             = {
                  + cert-manager = {
                      + force                  = false
                      + path                   = "./"
                      + prune                  = false
                      + retryIntervalInSeconds = 300
                      + syncIntervalInSeconds  = 300
                      + timeoutInSeconds       = 300
                      + wait                   = true
                    }
                }
              + namespace                  = "flux-system"
              + ociRepository              = {
                  + insecure              = false
                  + repositoryRef         = {
                      + tag = "at_ring2"
                    }
                  + syncIntervalInSeconds = 300
                  + timeoutInSeconds      = 300
                  + url                   = "oci://altinncr.azurecr.io/manifests/infra/cert-manager"
                  + useWorkloadIdentity   = true
                }
              + reconciliationWaitDuration = "PT5M"
              + sourceKind                 = "OCIRepository"
              + waitForReconciliation      = true
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + ignore_null_property      = false
      + name                      = "cert-manager"
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/cc6b5886-36af-4d54-9d30-1b0fffc736d8/resourceGroups/corr-at22-aks-rg/providers/Microsoft.ContainerService/managedClusters/corr-at22-aks"
      + schema_validation_enabled = true
      + sensitive_body            = (write-only attribute)
      + type                      = "Microsoft.KubernetesConfiguration/fluxConfigurations@2024-11-01"
    }

  # module.infra-resources.azapi_resource.container_runtime_aks_config will be created
  + resource "azapi_resource" "container_runtime_aks_config" {
      + body                      = {
          + properties = {
              + kustomizations             = {
                  + aks-config-ama            = {
                      + force                  = false
                      + path                   = "./ama/"
                      + prune                  = false
                      + retryIntervalInSeconds = 300
                      + syncIntervalInSeconds  = 300
                      + timeoutInSeconds       = 300
                      + wait                   = true
                    }
                  + aks-config-metrics-server = {
                      + force                  = false
                      + path                   = "./metrics-server/"
                      + prune                  = false
                      + retryIntervalInSeconds = 300
                      + syncIntervalInSeconds  = 300
                      + timeoutInSeconds       = 300
                      + wait                   = true
                    }
                }
              + namespace                  = "flux-system"
              + ociRepository              = {
                  + insecure              = false
                  + repositoryRef         = {
                      + tag = "at_ring2"
                    }
                  + syncIntervalInSeconds = 300
                  + timeoutInSeconds      = 300
                  + url                   = "oci://altinncr.azurecr.io/manifests/infra/container-runtime-aks-config"
                  + useWorkloadIdentity   = true
                }
              + reconciliationWaitDuration = "PT5M"
              + sourceKind                 = "OCIRepository"
              + waitForReconciliation      = true
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + ignore_null_property      = false
      + name                      = "container-runtime-aks-config"
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/cc6b5886-36af-4d54-9d30-1b0fffc736d8/resourceGroups/corr-at22-aks-rg/providers/Microsoft.ContainerService/managedClusters/corr-at22-aks"
      + schema_validation_enabled = true
      + sensitive_body            = (write-only attribute)
      + type                      = "Microsoft.KubernetesConfiguration/fluxConfigurations@2024-11-01"
    }

  # module.infra-resources.azapi_resource.dis_identity_operator[0] will be created
  + resource "azapi_resource" "dis_identity_operator" {
      + body                      = {
          + properties = {
              + kustomizations             = {
                  + dis-identity = {
                      + force                  = false
                      + path                   = "./"
                      + postBuild              = {
                          + substitute = {
                              + DISID_ISSUER_URL            = "https://norwayeast.oic.prod-aks.azure.com/cd0026d8-283b-4a55-9bfa-d0ef4a8ba21c/9a2c3489-7817-4ba0-9a4a-4600bb14b520/"
                              + DISID_TARGET_RESOURCE_GROUP = "/subscriptions/cc6b5886-36af-4d54-9d30-1b0fffc736d8/resourceGroups/DIS_corr-at22_main-rg"
                            }
                        }
                      + prune                  = false
                      + retryIntervalInSeconds = 300
                      + syncIntervalInSeconds  = 300
                      + timeoutInSeconds       = 300
                      + wait                   = true
                    }
                }
              + namespace                  = "flux-system"
              + ociRepository              = {
                  + insecure              = false
                  + repositoryRef         = {
                      + tag = "at_ring2"
                    }
                  + syncIntervalInSeconds = 300
                  + timeoutInSeconds      = 300
                  + url                   = "oci://altinncr.azurecr.io/manifests/infra/dis-identity"
                  + useWorkloadIdentity   = true
                }
              + reconciliationWaitDuration = "PT5M"
              + sourceKind                 = "OCIRepository"
              + waitForReconciliation      = true
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + ignore_null_property      = false
      + name                      = "dis-identity"
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/cc6b5886-36af-4d54-9d30-1b0fffc736d8/resourceGroups/corr-at22-aks-rg/providers/Microsoft.ContainerService/managedClusters/corr-at22-aks"
      + schema_validation_enabled = true
      + sensitive_body            = (write-only attribute)
      + type                      = "Microsoft.KubernetesConfiguration/fluxConfigurations@2024-11-01"
    }

  # module.infra-resources.azapi_resource.eso will be created
  + resource "azapi_resource" "eso" {
      + body                      = {
          + properties = {
              + kustomizations             = {
                  + external-secrets-operator = {
                      + force                  = false
                      + path                   = "./"
                      + prune                  = false
                      + retryIntervalInSeconds = 300
                      + syncIntervalInSeconds  = 300
                      + timeoutInSeconds       = 300
                      + wait                   = true
                    }
                }
              + namespace                  = "flux-system"
              + ociRepository              = {
                  + insecure              = false
                  + repositoryRef         = {
                      + tag = "at_ring2"
                    }
                  + syncIntervalInSeconds = 300
                  + timeoutInSeconds      = 300
                  + url                   = "oci://altinncr.azurecr.io/manifests/infra/external-secrets-operator"
                  + useWorkloadIdentity   = true
                }
              + reconciliationWaitDuration = "PT5M"
              + sourceKind                 = "OCIRepository"
              + waitForReconciliation      = true
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + ignore_null_property      = false
      + name                      = "external-secrets-operator"
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/cc6b5886-36af-4d54-9d30-1b0fffc736d8/resourceGroups/corr-at22-aks-rg/providers/Microsoft.ContainerService/managedClusters/corr-at22-aks"
      + schema_validation_enabled = true
      + sensitive_body            = (write-only attribute)
      + type                      = "Microsoft.KubernetesConfiguration/fluxConfigurations@2024-11-01"
    }

  # module.infra-resources.azapi_resource.flux_syncroot will be created
  + resource "azapi_resource" "flux_syncroot" {
      + body                      = {
          + properties = {
              + kustomizations             = {
                  + syncroot = {
                      + force                  = false
                      + path                   = "./at22"
                      + prune                  = false
                      + retryIntervalInSeconds = 300
                      + syncIntervalInSeconds  = 300
                      + timeoutInSeconds       = 600
                      + wait                   = true
                    }
                }
              + namespace                  = "corr"
              + ociRepository              = {
                  + insecure              = false
                  + repositoryRef         = {
                      + tag = "at22"
                    }
                  + syncIntervalInSeconds = 300
                  + timeoutInSeconds      = 300
                  + url                   = "oci://altinncr.azurecr.io/corr/syncroot"
                  + useWorkloadIdentity   = true
                }
              + reconciliationWaitDuration = "PT5M"
              + sourceKind                 = "OCIRepository"
              + waitForReconciliation      = false
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + ignore_null_property      = false
      + name                      = "syncroot-corr-at22"
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/cc6b5886-36af-4d54-9d30-1b0fffc736d8/resourceGroups/corr-at22-aks-rg/providers/Microsoft.ContainerService/managedClusters/corr-at22-aks"
      + schema_validation_enabled = true
      + sensitive_body            = (write-only attribute)
      + type                      = "Microsoft.KubernetesConfiguration/fluxConfigurations@2024-11-01"
    }

  # module.infra-resources.azapi_resource.grafana_manifests[0] will be created
  + resource "azapi_resource" "grafana_manifests" {
      + body                      = {
          + properties = {
              + kustomizations             = {
                  + grafana-manifests = {
                      + force                  = false
                      + path                   = "./dashboards/"
                      + postBuild              = {
                          + substitute = {
                              + RELEASE_BRANCH = "release"
                            }
                        }
                      + prune                  = false
                      + retryIntervalInSeconds = 300
                      + syncIntervalInSeconds  = 300
                      + timeoutInSeconds       = 300
                      + wait                   = true
                    }
                }
              + namespace                  = "flux-system"
              + ociRepository              = {
                  + insecure              = false
                  + repositoryRef         = {
                      + tag = "at_ring2"
                    }
                  + syncIntervalInSeconds = 300
                  + timeoutInSeconds      = 300
                  + url                   = "oci://altinncr.azurecr.io/manifests/infra/grafana-manifests"
                  + useWorkloadIdentity   = true
                }
              + reconciliationWaitDuration = "PT5M"
              + sourceKind                 = "OCIRepository"
              + waitForReconciliation      = true
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + ignore_null_property      = false
      + name                      = "grafana-manifests"
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/cc6b5886-36af-4d54-9d30-1b0fffc736d8/resourceGroups/corr-at22-aks-rg/providers/Microsoft.ContainerService/managedClusters/corr-at22-aks"
      + schema_validation_enabled = true
      + sensitive_body            = (write-only attribute)
      + type                      = "Microsoft.KubernetesConfiguration/fluxConfigurations@2024-11-01"
    }

  # module.infra-resources.azapi_resource.grafana_operator[0] will be created
  + resource "azapi_resource" "grafana_operator" {
      + body                      = {
          + properties = {
              + kustomizations             = {
                  + grafana-operator             = {
                      + force                  = false
                      + path                   = "./"
                      + postBuild              = {
                          + substitute = {
                              + GRAFANA_ADMIN_APIKEY = (sensitive value)
                            }
                        }
                      + prune                  = false
                      + retryIntervalInSeconds = 300
                      + syncIntervalInSeconds  = 300
                      + timeoutInSeconds       = 300
                      + wait                   = true
                    }
                  + grafana-operator-post-deploy = {
                      + dependsOn              = [
                          + "grafana-operator",
                        ]
                      + force                  = false
                      + path                   = "./post-deploy/"
                      + postBuild              = {
                          + substitute = {
                              + EXTERNAL_GRAFANA_URL = (known after apply)
                            }
                        }
                      + prune                  = false
                      + retryIntervalInSeconds = 300
                      + syncIntervalInSeconds  = 300
                      + timeoutInSeconds       = 300
                      + wait                   = true
                    }
                }
              + namespace                  = "flux-system"
              + ociRepository              = {
                  + insecure              = false
                  + repositoryRef         = {
                      + tag = "at_ring2"
                    }
                  + syncIntervalInSeconds = 300
                  + timeoutInSeconds      = 300
                  + url                   = "oci://altinncr.azurecr.io/manifests/infra/grafana-operator"
                  + useWorkloadIdentity   = true
                }
              + reconciliationWaitDuration = "PT5M"
              + sourceKind                 = "OCIRepository"
              + waitForReconciliation      = true
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + ignore_null_property      = false
      + location                  = (known after apply)
      + name                      = "grafana-operator"
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/cc6b5886-36af-4d54-9d30-1b0fffc736d8/resourceGroups/corr-at22-aks-rg/providers/Microsoft.ContainerService/managedClusters/corr-at22-aks"
      + schema_validation_enabled = true
      + sensitive_body            = (write-only attribute)
      + tags                      = (known after apply)
      + type                      = "Microsoft.KubernetesConfiguration/fluxConfigurations@2024-11-01"
    }

  # module.infra-resources.azapi_resource.linkerd will be created
  + resource "azapi_resource" "linkerd" {
      + body                      = {
          + properties = {
              + kustomizations             = {
                  + linkerd             = {
                      + force                  = false
                      + path                   = "./"
                      + postBuild              = {
                          + substitute = {
                              + DISABLE_IPV6 = "false"
                            }
                        }
                      + prune                  = false
                      + retryIntervalInSeconds = 300
                      + syncIntervalInSeconds  = 300
                      + timeoutInSeconds       = 600
                      + wait                   = true
                    }
                  + linkerd-post-deploy = {
                      + dependsOn              = [
                          + "linkerd",
                        ]
                      + force                  = true
                      + path                   = "./post-deploy/"
                      + prune                  = true
                      + retryIntervalInSeconds = 300
                      + syncIntervalInSeconds  = 31557600
                      + timeoutInSeconds       = 300
                      + wait                   = true
                    }
                }
              + namespace                  = "flux-system"
              + ociRepository              = {
                  + insecure              = false
                  + repositoryRef         = {
                      + tag = "at_ring2"
                    }
                  + syncIntervalInSeconds = 300
                  + timeoutInSeconds      = 300
                  + url                   = "oci://altinncr.azurecr.io/manifests/infra/linkerd"
                  + useWorkloadIdentity   = true
                }
              + reconciliationWaitDuration = "PT5M"
              + sourceKind                 = "OCIRepository"
              + waitForReconciliation      = true
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + ignore_null_property      = false
      + name                      = "linkerd"
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/cc6b5886-36af-4d54-9d30-1b0fffc736d8/resourceGroups/corr-at22-aks-rg/providers/Microsoft.ContainerService/managedClusters/corr-at22-aks"
      + schema_validation_enabled = true
      + sensitive_body            = (write-only attribute)
      + type                      = "Microsoft.KubernetesConfiguration/fluxConfigurations@2024-11-01"
    }

  # module.infra-resources.azapi_resource.otel_collector will be created
  + resource "azapi_resource" "otel_collector" {
      + body                      = {
          + properties = {
              + kustomizations             = {
                  + otel-collector = {
                      + force                  = false
                      + path                   = "./"
                      + postBuild              = {
                          + substitute = {
                              + CLIENT_ID = (sensitive value)
                              + KV_URI    = (sensitive value)
                              + TENANT_ID = (sensitive value)
                            }
                        }
                      + prune                  = false
                      + retryIntervalInSeconds = 300
                      + syncIntervalInSeconds  = 300
                      + timeoutInSeconds       = 300
                      + wait                   = true
                    }
                }
              + namespace                  = "flux-system"
              + ociRepository              = {
                  + insecure              = false
                  + repositoryRef         = {
                      + tag = "at_ring2"
                    }
                  + syncIntervalInSeconds = 300
                  + timeoutInSeconds      = 300
                  + url                   = "oci://altinncr.azurecr.io/manifests/infra/otel-collector"
                  + useWorkloadIdentity   = true
                }
              + reconciliationWaitDuration = "PT5M"
              + sourceKind                 = "OCIRepository"
              + waitForReconciliation      = true
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + ignore_null_property      = false
      + name                      = "otel-collector"
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/cc6b5886-36af-4d54-9d30-1b0fffc736d8/resourceGroups/corr-at22-aks-rg/providers/Microsoft.ContainerService/managedClusters/corr-at22-aks"
      + schema_validation_enabled = true
      + sensitive_body            = (write-only attribute)
      + type                      = "Microsoft.KubernetesConfiguration/fluxConfigurations@2024-11-01"
    }

  # module.infra-resources.azapi_resource.otel_operator will be created
  + resource "azapi_resource" "otel_operator" {
      + body                      = {
          + properties = {
              + kustomizations             = {
                  + otel-operator = {
                      + force                  = false
                      + path                   = "./"
                      + prune                  = false
                      + retryIntervalInSeconds = 300
                      + syncIntervalInSeconds  = 300
                      + timeoutInSeconds       = 300
                      + wait                   = true
                    }
                }
              + namespace                  = "flux-system"
              + ociRepository              = {
                  + insecure              = false
                  + repositoryRef         = {
                      + tag = "at_ring2"
                    }
                  + syncIntervalInSeconds = 300
                  + timeoutInSeconds      = 300
                  + url                   = "oci://altinncr.azurecr.io/manifests/infra/otel-operator"
                  + useWorkloadIdentity   = true
                }
              + reconciliationWaitDuration = "PT5M"
              + sourceKind                 = "OCIRepository"
              + waitForReconciliation      = true
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + ignore_null_property      = false
      + name                      = "otel-operator"
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/cc6b5886-36af-4d54-9d30-1b0fffc736d8/resourceGroups/corr-at22-aks-rg/providers/Microsoft.ContainerService/managedClusters/corr-at22-aks"
      + schema_validation_enabled = true
      + sensitive_body            = (write-only attribute)
      + type                      = "Microsoft.KubernetesConfiguration/fluxConfigurations@2024-11-01"
    }

  # module.infra-resources.azapi_resource.traefik will be created
  + resource "azapi_resource" "traefik" {
      + body                      = {
          + properties = {
              + kustomizations             = {
                  + traefik = {
                      + force                  = false
                      + path                   = "./"
                      + postBuild              = {
                          + substitute = {
                              + AKS_NODE_RG              = "MC_corr-at22-aks-rg_corr-at22-aks_norwayeast"
                              + AKS_SYSP00L_IP_PREFIX_0  = "fd96:20bf:3235:1::/64"
                              + AKS_SYSP00L_IP_PREFIX_1  = "10.203.1.0/24"
                              + AKS_WORKPOOL_IP_PREFIX_0 = "fd96:20bf:3235:2::/64"
                              + AKS_WORKPOOL_IP_PREFIX_1 = "10.203.2.0/24"
                              + PUBLIC_IP_V4             = "20.251.17.51"
                              + PUBLIC_IP_V6             = "2603:1020:e01:d::2a"
                            }
                        }
                      + prune                  = false
                      + retryIntervalInSeconds = 300
                      + syncIntervalInSeconds  = 300
                      + timeoutInSeconds       = 300
                      + wait                   = true
                    }
                }
              + namespace                  = "flux-system"
              + ociRepository              = {
                  + insecure              = false
                  + repositoryRef         = {
                      + tag = "at_ring2"
                    }
                  + syncIntervalInSeconds = 300
                  + timeoutInSeconds      = 300
                  + url                   = "oci://altinncr.azurecr.io/manifests/infra/traefik"
                  + useWorkloadIdentity   = true
                }
              + reconciliationWaitDuration = "PT5M"
              + sourceKind                 = "OCIRepository"
              + waitForReconciliation      = true
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + ignore_null_property      = false
      + name                      = "traefik"
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/cc6b5886-36af-4d54-9d30-1b0fffc736d8/resourceGroups/corr-at22-aks-rg/providers/Microsoft.ContainerService/managedClusters/corr-at22-aks"
      + schema_validation_enabled = true
      + sensitive_body            = (write-only attribute)
      + type                      = "Microsoft.KubernetesConfiguration/fluxConfigurations@2024-11-01"
    }

  # module.observability.azurerm_key_vault_secret.conn_string will be created
  + resource "azurerm_key_vault_secret" "conn_string" {
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/cc6b5886-36af-4d54-9d30-1b0fffc736d8/resourceGroups/corr-at22-obs-rg/providers/Microsoft.KeyVault/vaults/obs-corr-at22-B5W6pl"
      + name                    = "connectionString"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

Plan: 22 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @tjololo |
| Action | `push` |
| Working Directory | `./infrastructure/altinn-correspondence-test/corr-at22-aks-rg` |
| State File | `github.com/altinn/altinn-platform/environments/test/corr-at22-aks-rg.tfstate` |
| Plan File | `github.com_altinn_altinn-platform_environments_test_corr-at22-aks-rg.tfstate.tfplan` |